Revit 2024 API
Macro Properties
The Macro type exposes the following members.
Properties
Name | Description
Description
 The macro description.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
MacroModule
 The Macro module.
Name
 The macro name.
See Also
Macro Class
Autodesk.Revit.DB.Macros Namespace